{"modelTopology": {"model_config": {"config": {"name": "mobilenet_1.00_224", "output_layers": [["reshape_2", 0, 0]], "input_layers": [["input_2", 0, 0]], "layers": [{"name": "input_2", "class_name": "InputLayer", "inbound_nodes": [], "config": {"batch_input_shape": [null, 224, 224, 3], "sparse": false, "dtype": "float32", "name": "input_2"}}, {"name": "conv1_pad", "class_name": "ZeroPadding2D", "inbound_nodes": [[["input_2", 0, 0, {}]]], "config": {"name": "conv1_pad", "padding": [[0, 1], [0, 1]], "data_format": "channels_last", "trainable": true}}, {"name": "conv1", "class_name": "Conv2D", "inbound_nodes": [[["conv1_pad", 0, 0, {}]]], "config": {"activation": "linear", "use_bias": false, "bias_constraint": null, "filters": 32, "trainable": true, "dilation_rate": [1, 1], "strides": [2, 2], "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_last", "name": "conv1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "padding": "valid", "bias_regularizer": null, "kernel_constraint": null}}, {"name": "conv1_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv1", 0, 0, {}]]], "config": {"moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "gamma_constraint": null, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "epsilon": 0.001, "gamma_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "axis": -1, "name": "conv1_bn", "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null}}, {"name": "conv1_relu", "class_name": "ReLU", "inbound_nodes": [[["conv1_bn", 0, 0, {}]]], "config": {"name": "conv1_relu", "max_value": 6.0, "trainable": true}}, {"name": "conv_dw_1", "class_name": "DepthwiseConv2D", "inbound_nodes": [[["conv1_relu", 0, 0, {}]]], "config": {"depthwise_regularizer": null, "activation": "linear", "use_bias": false, "bias_constraint": null, "trainable": true, "dilation_rate": [1, 1], "name": "conv_dw_1", "depthwise_constraint": null, "kernel_size": [3, 3], "strides": [1, 1], "depth_multiplier": 1, "activity_regularizer": null, "depthwise_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "same", "data_format": "channels_last", "bias_regularizer": null}}, {"name": "conv_dw_1_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv_dw_1", 0, 0, {}]]], "config": {"moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "gamma_constraint": null, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "epsilon": 0.001, "gamma_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "axis": -1, "name": "conv_dw_1_bn", "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null}}, {"name": "conv_dw_1_relu", "class_name": "ReLU", "inbound_nodes": [[["conv_dw_1_bn", 0, 0, {}]]], "config": {"name": "conv_dw_1_relu", "max_value": 6.0, "trainable": true}}, {"name": "conv_pw_1", "class_name": "Conv2D", "inbound_nodes": [[["conv_dw_1_relu", 0, 0, {}]]], "config": {"activation": "linear", "use_bias": false, "bias_constraint": null, "filters": 64, "trainable": true, "dilation_rate": [1, 1], "strides": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "kernel_size": [1, 1], "data_format": "channels_last", "name": "conv_pw_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "padding": "same", "bias_regularizer": null, "kernel_constraint": null}}, {"name": "conv_pw_1_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv_pw_1", 0, 0, {}]]], "config": {"moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "gamma_constraint": null, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "epsilon": 0.001, "gamma_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "axis": -1, "name": "conv_pw_1_bn", "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null}}, {"name": "conv_pw_1_relu", "class_name": "ReLU", "inbound_nodes": [[["conv_pw_1_bn", 0, 0, {}]]], "config": {"name": "conv_pw_1_relu", "max_value": 6.0, "trainable": true}}, {"name": "conv_pad_2", "class_name": "ZeroPadding2D", "inbound_nodes": [[["conv_pw_1_relu", 0, 0, {}]]], "config": {"name": "conv_pad_2", "padding": [[0, 1], [0, 1]], "data_format": "channels_last", "trainable": true}}, {"name": "conv_dw_2", "class_name": "DepthwiseConv2D", "inbound_nodes": [[["conv_pad_2", 0, 0, {}]]], "config": {"depthwise_regularizer": null, "activation": "linear", "use_bias": false, "bias_constraint": null, "trainable": true, "dilation_rate": [1, 1], "name": "conv_dw_2", "depthwise_constraint": null, "kernel_size": [3, 3], "strides": [2, 2], "depth_multiplier": 1, "activity_regularizer": null, "depthwise_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "valid", "data_format": "channels_last", "bias_regularizer": null}}, {"name": "conv_dw_2_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv_dw_2", 0, 0, {}]]], "config": {"moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "gamma_constraint": null, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "epsilon": 0.001, "gamma_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "axis": -1, "name": "conv_dw_2_bn", "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null}}, {"name": "conv_dw_2_relu", "class_name": "ReLU", "inbound_nodes": [[["conv_dw_2_bn", 0, 0, {}]]], "config": {"name": "conv_dw_2_relu", "max_value": 6.0, "trainable": true}}, {"name": "conv_pw_2", "class_name": "Conv2D", "inbound_nodes": [[["conv_dw_2_relu", 0, 0, {}]]], "config": {"activation": "linear", "use_bias": false, "bias_constraint": null, "filters": 128, "trainable": true, "dilation_rate": [1, 1], "strides": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "kernel_size": [1, 1], "data_format": "channels_last", "name": "conv_pw_2", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "padding": "same", "bias_regularizer": null, "kernel_constraint": null}}, {"name": "conv_pw_2_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv_pw_2", 0, 0, {}]]], "config": {"moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "gamma_constraint": null, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "epsilon": 0.001, "gamma_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "axis": -1, "name": "conv_pw_2_bn", "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null}}, {"name": "conv_pw_2_relu", "class_name": "ReLU", "inbound_nodes": [[["conv_pw_2_bn", 0, 0, {}]]], "config": {"name": "conv_pw_2_relu", "max_value": 6.0, "trainable": true}}, {"name": "conv_dw_3", "class_name": "DepthwiseConv2D", "inbound_nodes": [[["conv_pw_2_relu", 0, 0, {}]]], "config": {"depthwise_regularizer": null, "activation": "linear", "use_bias": false, "bias_constraint": null, "trainable": true, "dilation_rate": [1, 1], "name": "conv_dw_3", "depthwise_constraint": null, "kernel_size": [3, 3], "strides": [1, 1], "depth_multiplier": 1, "activity_regularizer": null, "depthwise_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "same", "data_format": "channels_last", "bias_regularizer": null}}, {"name": "conv_dw_3_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv_dw_3", 0, 0, {}]]], "config": {"moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "gamma_constraint": null, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "epsilon": 0.001, "gamma_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "axis": -1, "name": "conv_dw_3_bn", "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null}}, {"name": "conv_dw_3_relu", "class_name": "ReLU", "inbound_nodes": [[["conv_dw_3_bn", 0, 0, {}]]], "config": {"name": "conv_dw_3_relu", "max_value": 6.0, "trainable": true}}, {"name": "conv_pw_3", "class_name": "Conv2D", "inbound_nodes": [[["conv_dw_3_relu", 0, 0, {}]]], "config": {"activation": "linear", "use_bias": false, "bias_constraint": null, "filters": 128, "trainable": true, "dilation_rate": [1, 1], "strides": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "kernel_size": [1, 1], "data_format": "channels_last", "name": "conv_pw_3", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "padding": "same", "bias_regularizer": null, "kernel_constraint": null}}, {"name": "conv_pw_3_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv_pw_3", 0, 0, {}]]], "config": {"moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "gamma_constraint": null, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "epsilon": 0.001, "gamma_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "axis": -1, "name": "conv_pw_3_bn", "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null}}, {"name": "conv_pw_3_relu", "class_name": "ReLU", "inbound_nodes": [[["conv_pw_3_bn", 0, 0, {}]]], "config": {"name": "conv_pw_3_relu", "max_value": 6.0, "trainable": true}}, {"name": "conv_pad_4", "class_name": "ZeroPadding2D", "inbound_nodes": [[["conv_pw_3_relu", 0, 0, {}]]], "config": {"name": "conv_pad_4", "padding": [[0, 1], [0, 1]], "data_format": "channels_last", "trainable": true}}, {"name": "conv_dw_4", "class_name": "DepthwiseConv2D", "inbound_nodes": [[["conv_pad_4", 0, 0, {}]]], "config": {"depthwise_regularizer": null, "activation": "linear", "use_bias": false, "bias_constraint": null, "trainable": true, "dilation_rate": [1, 1], "name": "conv_dw_4", "depthwise_constraint": null, "kernel_size": [3, 3], "strides": [2, 2], "depth_multiplier": 1, "activity_regularizer": null, "depthwise_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "valid", "data_format": "channels_last", "bias_regularizer": null}}, {"name": "conv_dw_4_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv_dw_4", 0, 0, {}]]], "config": {"moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "gamma_constraint": null, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "epsilon": 0.001, "gamma_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "axis": -1, "name": "conv_dw_4_bn", "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null}}, {"name": "conv_dw_4_relu", "class_name": "ReLU", "inbound_nodes": [[["conv_dw_4_bn", 0, 0, {}]]], "config": {"name": "conv_dw_4_relu", "max_value": 6.0, "trainable": true}}, {"name": "conv_pw_4", "class_name": "Conv2D", "inbound_nodes": [[["conv_dw_4_relu", 0, 0, {}]]], "config": {"activation": "linear", "use_bias": false, "bias_constraint": null, "filters": 256, "trainable": true, "dilation_rate": [1, 1], "strides": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "kernel_size": [1, 1], "data_format": "channels_last", "name": "conv_pw_4", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "padding": "same", "bias_regularizer": null, "kernel_constraint": null}}, {"name": "conv_pw_4_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv_pw_4", 0, 0, {}]]], "config": {"moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "gamma_constraint": null, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "epsilon": 0.001, "gamma_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "axis": -1, "name": "conv_pw_4_bn", "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null}}, {"name": "conv_pw_4_relu", "class_name": "ReLU", "inbound_nodes": [[["conv_pw_4_bn", 0, 0, {}]]], "config": {"name": "conv_pw_4_relu", "max_value": 6.0, "trainable": true}}, {"name": "conv_dw_5", "class_name": "DepthwiseConv2D", "inbound_nodes": [[["conv_pw_4_relu", 0, 0, {}]]], "config": {"depthwise_regularizer": null, "activation": "linear", "use_bias": false, "bias_constraint": null, "trainable": true, "dilation_rate": [1, 1], "name": "conv_dw_5", "depthwise_constraint": null, "kernel_size": [3, 3], "strides": [1, 1], "depth_multiplier": 1, "activity_regularizer": null, "depthwise_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "same", "data_format": "channels_last", "bias_regularizer": null}}, {"name": "conv_dw_5_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv_dw_5", 0, 0, {}]]], "config": {"moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "gamma_constraint": null, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "epsilon": 0.001, "gamma_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "axis": -1, "name": "conv_dw_5_bn", "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null}}, {"name": "conv_dw_5_relu", "class_name": "ReLU", "inbound_nodes": [[["conv_dw_5_bn", 0, 0, {}]]], "config": {"name": "conv_dw_5_relu", "max_value": 6.0, "trainable": true}}, {"name": "conv_pw_5", "class_name": "Conv2D", "inbound_nodes": [[["conv_dw_5_relu", 0, 0, {}]]], "config": {"activation": "linear", "use_bias": false, "bias_constraint": null, "filters": 256, "trainable": true, "dilation_rate": [1, 1], "strides": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "kernel_size": [1, 1], "data_format": "channels_last", "name": "conv_pw_5", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "padding": "same", "bias_regularizer": null, "kernel_constraint": null}}, {"name": "conv_pw_5_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv_pw_5", 0, 0, {}]]], "config": {"moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "gamma_constraint": null, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "epsilon": 0.001, "gamma_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "axis": -1, "name": "conv_pw_5_bn", "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null}}, {"name": "conv_pw_5_relu", "class_name": "ReLU", "inbound_nodes": [[["conv_pw_5_bn", 0, 0, {}]]], "config": {"name": "conv_pw_5_relu", "max_value": 6.0, "trainable": true}}, {"name": "conv_pad_6", "class_name": "ZeroPadding2D", "inbound_nodes": [[["conv_pw_5_relu", 0, 0, {}]]], "config": {"name": "conv_pad_6", "padding": [[0, 1], [0, 1]], "data_format": "channels_last", "trainable": true}}, {"name": "conv_dw_6", "class_name": "DepthwiseConv2D", "inbound_nodes": [[["conv_pad_6", 0, 0, {}]]], "config": {"depthwise_regularizer": null, "activation": "linear", "use_bias": false, "bias_constraint": null, "trainable": true, "dilation_rate": [1, 1], "name": "conv_dw_6", "depthwise_constraint": null, "kernel_size": [3, 3], "strides": [2, 2], "depth_multiplier": 1, "activity_regularizer": null, "depthwise_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "valid", "data_format": "channels_last", "bias_regularizer": null}}, {"name": "conv_dw_6_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv_dw_6", 0, 0, {}]]], "config": {"moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "gamma_constraint": null, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "epsilon": 0.001, "gamma_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "axis": -1, "name": "conv_dw_6_bn", "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null}}, {"name": "conv_dw_6_relu", "class_name": "ReLU", "inbound_nodes": [[["conv_dw_6_bn", 0, 0, {}]]], "config": {"name": "conv_dw_6_relu", "max_value": 6.0, "trainable": true}}, {"name": "conv_pw_6", "class_name": "Conv2D", "inbound_nodes": [[["conv_dw_6_relu", 0, 0, {}]]], "config": {"activation": "linear", "use_bias": false, "bias_constraint": null, "filters": 512, "trainable": true, "dilation_rate": [1, 1], "strides": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "kernel_size": [1, 1], "data_format": "channels_last", "name": "conv_pw_6", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "padding": "same", "bias_regularizer": null, "kernel_constraint": null}}, {"name": "conv_pw_6_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv_pw_6", 0, 0, {}]]], "config": {"moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "gamma_constraint": null, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "epsilon": 0.001, "gamma_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "axis": -1, "name": "conv_pw_6_bn", "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null}}, {"name": "conv_pw_6_relu", "class_name": "ReLU", "inbound_nodes": [[["conv_pw_6_bn", 0, 0, {}]]], "config": {"name": "conv_pw_6_relu", "max_value": 6.0, "trainable": true}}, {"name": "conv_dw_7", "class_name": "DepthwiseConv2D", "inbound_nodes": [[["conv_pw_6_relu", 0, 0, {}]]], "config": {"depthwise_regularizer": null, "activation": "linear", "use_bias": false, "bias_constraint": null, "trainable": true, "dilation_rate": [1, 1], "name": "conv_dw_7", "depthwise_constraint": null, "kernel_size": [3, 3], "strides": [1, 1], "depth_multiplier": 1, "activity_regularizer": null, "depthwise_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "same", "data_format": "channels_last", "bias_regularizer": null}}, {"name": "conv_dw_7_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv_dw_7", 0, 0, {}]]], "config": {"moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "gamma_constraint": null, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "epsilon": 0.001, "gamma_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "axis": -1, "name": "conv_dw_7_bn", "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null}}, {"name": "conv_dw_7_relu", "class_name": "ReLU", "inbound_nodes": [[["conv_dw_7_bn", 0, 0, {}]]], "config": {"name": "conv_dw_7_relu", "max_value": 6.0, "trainable": true}}, {"name": "conv_pw_7", "class_name": "Conv2D", "inbound_nodes": [[["conv_dw_7_relu", 0, 0, {}]]], "config": {"activation": "linear", "use_bias": false, "bias_constraint": null, "filters": 512, "trainable": true, "dilation_rate": [1, 1], "strides": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "kernel_size": [1, 1], "data_format": "channels_last", "name": "conv_pw_7", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "padding": "same", "bias_regularizer": null, "kernel_constraint": null}}, {"name": "conv_pw_7_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv_pw_7", 0, 0, {}]]], "config": {"moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "gamma_constraint": null, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "epsilon": 0.001, "gamma_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "axis": -1, "name": "conv_pw_7_bn", "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null}}, {"name": "conv_pw_7_relu", "class_name": "ReLU", "inbound_nodes": [[["conv_pw_7_bn", 0, 0, {}]]], "config": {"name": "conv_pw_7_relu", "max_value": 6.0, "trainable": true}}, {"name": "conv_dw_8", "class_name": "DepthwiseConv2D", "inbound_nodes": [[["conv_pw_7_relu", 0, 0, {}]]], "config": {"depthwise_regularizer": null, "activation": "linear", "use_bias": false, "bias_constraint": null, "trainable": true, "dilation_rate": [1, 1], "name": "conv_dw_8", "depthwise_constraint": null, "kernel_size": [3, 3], "strides": [1, 1], "depth_multiplier": 1, "activity_regularizer": null, "depthwise_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "same", "data_format": "channels_last", "bias_regularizer": null}}, {"name": "conv_dw_8_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv_dw_8", 0, 0, {}]]], "config": {"moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "gamma_constraint": null, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "epsilon": 0.001, "gamma_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "axis": -1, "name": "conv_dw_8_bn", "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null}}, {"name": "conv_dw_8_relu", "class_name": "ReLU", "inbound_nodes": [[["conv_dw_8_bn", 0, 0, {}]]], "config": {"name": "conv_dw_8_relu", "max_value": 6.0, "trainable": true}}, {"name": "conv_pw_8", "class_name": "Conv2D", "inbound_nodes": [[["conv_dw_8_relu", 0, 0, {}]]], "config": {"activation": "linear", "use_bias": false, "bias_constraint": null, "filters": 512, "trainable": true, "dilation_rate": [1, 1], "strides": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "kernel_size": [1, 1], "data_format": "channels_last", "name": "conv_pw_8", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "padding": "same", "bias_regularizer": null, "kernel_constraint": null}}, {"name": "conv_pw_8_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv_pw_8", 0, 0, {}]]], "config": {"moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "gamma_constraint": null, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "epsilon": 0.001, "gamma_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "axis": -1, "name": "conv_pw_8_bn", "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null}}, {"name": "conv_pw_8_relu", "class_name": "ReLU", "inbound_nodes": [[["conv_pw_8_bn", 0, 0, {}]]], "config": {"name": "conv_pw_8_relu", "max_value": 6.0, "trainable": true}}, {"name": "conv_dw_9", "class_name": "DepthwiseConv2D", "inbound_nodes": [[["conv_pw_8_relu", 0, 0, {}]]], "config": {"depthwise_regularizer": null, "activation": "linear", "use_bias": false, "bias_constraint": null, "trainable": true, "dilation_rate": [1, 1], "name": "conv_dw_9", "depthwise_constraint": null, "kernel_size": [3, 3], "strides": [1, 1], "depth_multiplier": 1, "activity_regularizer": null, "depthwise_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "same", "data_format": "channels_last", "bias_regularizer": null}}, {"name": "conv_dw_9_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv_dw_9", 0, 0, {}]]], "config": {"moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "gamma_constraint": null, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "epsilon": 0.001, "gamma_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "axis": -1, "name": "conv_dw_9_bn", "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null}}, {"name": "conv_dw_9_relu", "class_name": "ReLU", "inbound_nodes": [[["conv_dw_9_bn", 0, 0, {}]]], "config": {"name": "conv_dw_9_relu", "max_value": 6.0, "trainable": true}}, {"name": "conv_pw_9", "class_name": "Conv2D", "inbound_nodes": [[["conv_dw_9_relu", 0, 0, {}]]], "config": {"activation": "linear", "use_bias": false, "bias_constraint": null, "filters": 512, "trainable": true, "dilation_rate": [1, 1], "strides": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "kernel_size": [1, 1], "data_format": "channels_last", "name": "conv_pw_9", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "padding": "same", "bias_regularizer": null, "kernel_constraint": null}}, {"name": "conv_pw_9_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv_pw_9", 0, 0, {}]]], "config": {"moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "gamma_constraint": null, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "epsilon": 0.001, "gamma_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "axis": -1, "name": "conv_pw_9_bn", "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null}}, {"name": "conv_pw_9_relu", "class_name": "ReLU", "inbound_nodes": [[["conv_pw_9_bn", 0, 0, {}]]], "config": {"name": "conv_pw_9_relu", "max_value": 6.0, "trainable": true}}, {"name": "conv_dw_10", "class_name": "DepthwiseConv2D", "inbound_nodes": [[["conv_pw_9_relu", 0, 0, {}]]], "config": {"depthwise_regularizer": null, "activation": "linear", "use_bias": false, "bias_constraint": null, "trainable": true, "dilation_rate": [1, 1], "name": "conv_dw_10", "depthwise_constraint": null, "kernel_size": [3, 3], "strides": [1, 1], "depth_multiplier": 1, "activity_regularizer": null, "depthwise_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "same", "data_format": "channels_last", "bias_regularizer": null}}, {"name": "conv_dw_10_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv_dw_10", 0, 0, {}]]], "config": {"moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "gamma_constraint": null, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "epsilon": 0.001, "gamma_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "axis": -1, "name": "conv_dw_10_bn", "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null}}, {"name": "conv_dw_10_relu", "class_name": "ReLU", "inbound_nodes": [[["conv_dw_10_bn", 0, 0, {}]]], "config": {"name": "conv_dw_10_relu", "max_value": 6.0, "trainable": true}}, {"name": "conv_pw_10", "class_name": "Conv2D", "inbound_nodes": [[["conv_dw_10_relu", 0, 0, {}]]], "config": {"activation": "linear", "use_bias": false, "bias_constraint": null, "filters": 512, "trainable": true, "dilation_rate": [1, 1], "strides": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "kernel_size": [1, 1], "data_format": "channels_last", "name": "conv_pw_10", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "padding": "same", "bias_regularizer": null, "kernel_constraint": null}}, {"name": "conv_pw_10_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv_pw_10", 0, 0, {}]]], "config": {"moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "gamma_constraint": null, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "epsilon": 0.001, "gamma_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "axis": -1, "name": "conv_pw_10_bn", "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null}}, {"name": "conv_pw_10_relu", "class_name": "ReLU", "inbound_nodes": [[["conv_pw_10_bn", 0, 0, {}]]], "config": {"name": "conv_pw_10_relu", "max_value": 6.0, "trainable": true}}, {"name": "conv_dw_11", "class_name": "DepthwiseConv2D", "inbound_nodes": [[["conv_pw_10_relu", 0, 0, {}]]], "config": {"depthwise_regularizer": null, "activation": "linear", "use_bias": false, "bias_constraint": null, "trainable": true, "dilation_rate": [1, 1], "name": "conv_dw_11", "depthwise_constraint": null, "kernel_size": [3, 3], "strides": [1, 1], "depth_multiplier": 1, "activity_regularizer": null, "depthwise_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "same", "data_format": "channels_last", "bias_regularizer": null}}, {"name": "conv_dw_11_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv_dw_11", 0, 0, {}]]], "config": {"moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "gamma_constraint": null, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "epsilon": 0.001, "gamma_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "axis": -1, "name": "conv_dw_11_bn", "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null}}, {"name": "conv_dw_11_relu", "class_name": "ReLU", "inbound_nodes": [[["conv_dw_11_bn", 0, 0, {}]]], "config": {"name": "conv_dw_11_relu", "max_value": 6.0, "trainable": true}}, {"name": "conv_pw_11", "class_name": "Conv2D", "inbound_nodes": [[["conv_dw_11_relu", 0, 0, {}]]], "config": {"activation": "linear", "use_bias": false, "bias_constraint": null, "filters": 512, "trainable": true, "dilation_rate": [1, 1], "strides": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "kernel_size": [1, 1], "data_format": "channels_last", "name": "conv_pw_11", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "padding": "same", "bias_regularizer": null, "kernel_constraint": null}}, {"name": "conv_pw_11_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv_pw_11", 0, 0, {}]]], "config": {"moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "gamma_constraint": null, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "epsilon": 0.001, "gamma_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "axis": -1, "name": "conv_pw_11_bn", "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null}}, {"name": "conv_pw_11_relu", "class_name": "ReLU", "inbound_nodes": [[["conv_pw_11_bn", 0, 0, {}]]], "config": {"name": "conv_pw_11_relu", "max_value": 6.0, "trainable": true}}, {"name": "conv_pad_12", "class_name": "ZeroPadding2D", "inbound_nodes": [[["conv_pw_11_relu", 0, 0, {}]]], "config": {"name": "conv_pad_12", "padding": [[0, 1], [0, 1]], "data_format": "channels_last", "trainable": true}}, {"name": "conv_dw_12", "class_name": "DepthwiseConv2D", "inbound_nodes": [[["conv_pad_12", 0, 0, {}]]], "config": {"depthwise_regularizer": null, "activation": "linear", "use_bias": false, "bias_constraint": null, "trainable": true, "dilation_rate": [1, 1], "name": "conv_dw_12", "depthwise_constraint": null, "kernel_size": [3, 3], "strides": [2, 2], "depth_multiplier": 1, "activity_regularizer": null, "depthwise_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "valid", "data_format": "channels_last", "bias_regularizer": null}}, {"name": "conv_dw_12_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv_dw_12", 0, 0, {}]]], "config": {"moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "gamma_constraint": null, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "epsilon": 0.001, "gamma_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "axis": -1, "name": "conv_dw_12_bn", "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null}}, {"name": "conv_dw_12_relu", "class_name": "ReLU", "inbound_nodes": [[["conv_dw_12_bn", 0, 0, {}]]], "config": {"name": "conv_dw_12_relu", "max_value": 6.0, "trainable": true}}, {"name": "conv_pw_12", "class_name": "Conv2D", "inbound_nodes": [[["conv_dw_12_relu", 0, 0, {}]]], "config": {"activation": "linear", "use_bias": false, "bias_constraint": null, "filters": 1024, "trainable": true, "dilation_rate": [1, 1], "strides": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "kernel_size": [1, 1], "data_format": "channels_last", "name": "conv_pw_12", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "padding": "same", "bias_regularizer": null, "kernel_constraint": null}}, {"name": "conv_pw_12_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv_pw_12", 0, 0, {}]]], "config": {"moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "gamma_constraint": null, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "epsilon": 0.001, "gamma_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "axis": -1, "name": "conv_pw_12_bn", "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null}}, {"name": "conv_pw_12_relu", "class_name": "ReLU", "inbound_nodes": [[["conv_pw_12_bn", 0, 0, {}]]], "config": {"name": "conv_pw_12_relu", "max_value": 6.0, "trainable": true}}, {"name": "conv_dw_13", "class_name": "DepthwiseConv2D", "inbound_nodes": [[["conv_pw_12_relu", 0, 0, {}]]], "config": {"depthwise_regularizer": null, "activation": "linear", "use_bias": false, "bias_constraint": null, "trainable": true, "dilation_rate": [1, 1], "name": "conv_dw_13", "depthwise_constraint": null, "kernel_size": [3, 3], "strides": [1, 1], "depth_multiplier": 1, "activity_regularizer": null, "depthwise_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "same", "data_format": "channels_last", "bias_regularizer": null}}, {"name": "conv_dw_13_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv_dw_13", 0, 0, {}]]], "config": {"moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "gamma_constraint": null, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "epsilon": 0.001, "gamma_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "axis": -1, "name": "conv_dw_13_bn", "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null}}, {"name": "conv_dw_13_relu", "class_name": "ReLU", "inbound_nodes": [[["conv_dw_13_bn", 0, 0, {}]]], "config": {"name": "conv_dw_13_relu", "max_value": 6.0, "trainable": true}}, {"name": "conv_pw_13", "class_name": "Conv2D", "inbound_nodes": [[["conv_dw_13_relu", 0, 0, {}]]], "config": {"activation": "linear", "use_bias": false, "bias_constraint": null, "filters": 1024, "trainable": true, "dilation_rate": [1, 1], "strides": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "kernel_size": [1, 1], "data_format": "channels_last", "name": "conv_pw_13", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "padding": "same", "bias_regularizer": null, "kernel_constraint": null}}, {"name": "conv_pw_13_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv_pw_13", 0, 0, {}]]], "config": {"moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "gamma_constraint": null, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "epsilon": 0.001, "gamma_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "axis": -1, "name": "conv_pw_13_bn", "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null}}, {"name": "conv_pw_13_relu", "class_name": "ReLU", "inbound_nodes": [[["conv_pw_13_bn", 0, 0, {}]]], "config": {"name": "conv_pw_13_relu", "max_value": 6.0, "trainable": true}}, {"name": "global_average_pooling2d_1", "class_name": "GlobalAveragePooling2D", "inbound_nodes": [[["conv_pw_13_relu", 0, 0, {}]]], "config": {"name": "global_average_pooling2d_1", "data_format": "channels_last", "trainable": true}}, {"name": "reshape_1", "class_name": "Reshape", "inbound_nodes": [[["global_average_pooling2d_1", 0, 0, {}]]], "config": {"name": "reshape_1", "target_shape": [1, 1, 1024], "trainable": true}}, {"name": "dropout", "class_name": "Dropout", "inbound_nodes": [[["reshape_1", 0, 0, {}]]], "config": {"rate": 0.001, "name": "dropout", "noise_shape": null, "seed": null, "trainable": true}}, {"name": "conv_preds", "class_name": "Conv2D", "inbound_nodes": [[["dropout", 0, 0, {}]]], "config": {"activation": "linear", "use_bias": true, "bias_constraint": null, "filters": 1000, "trainable": true, "dilation_rate": [1, 1], "strides": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "kernel_size": [1, 1], "data_format": "channels_last", "name": "conv_preds", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "padding": "same", "bias_regularizer": null, "kernel_constraint": null}}, {"name": "act_softmax", "class_name": "Activation", "inbound_nodes": [[["conv_preds", 0, 0, {}]]], "config": {"name": "act_softmax", "activation": "softmax", "trainable": true}}, {"name": "reshape_2", "class_name": "Reshape", "inbound_nodes": [[["act_softmax", 0, 0, {}]]], "config": {"name": "reshape_2", "target_shape": [1000], "trainable": true}}]}, "class_name": "Model"}, "backend": "tensorflow", "keras_version": "2.2.2"}, "weightsManifest": [{"weights": [{"name": "conv1/kernel", "shape": [3, 3, 3, 32], "dtype": "float32"}, {"name": "conv1_bn/gamma", "shape": [32], "dtype": "float32"}, {"name": "conv1_bn/beta", "shape": [32], "dtype": "float32"}, {"name": "conv1_bn/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "conv1_bn/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "conv_dw_1/depthwise_kernel", "shape": [3, 3, 32, 1], "dtype": "float32"}, {"name": "conv_dw_10/depthwise_kernel", "shape": [3, 3, 512, 1], "dtype": "float32"}, {"name": "conv_dw_10_bn/gamma", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_10_bn/beta", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_10_bn/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_10_bn/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_11/depthwise_kernel", "shape": [3, 3, 512, 1], "dtype": "float32"}, {"name": "conv_dw_11_bn/gamma", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_11_bn/beta", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_11_bn/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_11_bn/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_12/depthwise_kernel", "shape": [3, 3, 512, 1], "dtype": "float32"}, {"name": "conv_dw_12_bn/gamma", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_12_bn/beta", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_12_bn/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_12_bn/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_13/depthwise_kernel", "shape": [3, 3, 1024, 1], "dtype": "float32"}, {"name": "conv_dw_13_bn/gamma", "shape": [1024], "dtype": "float32"}, {"name": "conv_dw_13_bn/beta", "shape": [1024], "dtype": "float32"}, {"name": "conv_dw_13_bn/moving_mean", "shape": [1024], "dtype": "float32"}, {"name": "conv_dw_13_bn/moving_variance", "shape": [1024], "dtype": "float32"}, {"name": "conv_dw_1_bn/gamma", "shape": [32], "dtype": "float32"}, {"name": "conv_dw_1_bn/beta", "shape": [32], "dtype": "float32"}, {"name": "conv_dw_1_bn/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "conv_dw_1_bn/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "conv_dw_2/depthwise_kernel", "shape": [3, 3, 64, 1], "dtype": "float32"}, {"name": "conv_dw_2_bn/gamma", "shape": [64], "dtype": "float32"}, {"name": "conv_dw_2_bn/beta", "shape": [64], "dtype": "float32"}, {"name": "conv_dw_2_bn/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "conv_dw_2_bn/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "conv_dw_3/depthwise_kernel", "shape": [3, 3, 128, 1], "dtype": "float32"}, {"name": "conv_dw_3_bn/gamma", "shape": [128], "dtype": "float32"}, {"name": "conv_dw_3_bn/beta", "shape": [128], "dtype": "float32"}, {"name": "conv_dw_3_bn/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "conv_dw_3_bn/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "conv_dw_4/depthwise_kernel", "shape": [3, 3, 128, 1], "dtype": "float32"}, {"name": "conv_dw_4_bn/gamma", "shape": [128], "dtype": "float32"}, {"name": "conv_dw_4_bn/beta", "shape": [128], "dtype": "float32"}, {"name": "conv_dw_4_bn/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "conv_dw_4_bn/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "conv_dw_5/depthwise_kernel", "shape": [3, 3, 256, 1], "dtype": "float32"}, {"name": "conv_dw_5_bn/gamma", "shape": [256], "dtype": "float32"}, {"name": "conv_dw_5_bn/beta", "shape": [256], "dtype": "float32"}, {"name": "conv_dw_5_bn/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "conv_dw_5_bn/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "conv_dw_6/depthwise_kernel", "shape": [3, 3, 256, 1], "dtype": "float32"}, {"name": "conv_dw_6_bn/gamma", "shape": [256], "dtype": "float32"}, {"name": "conv_dw_6_bn/beta", "shape": [256], "dtype": "float32"}, {"name": "conv_dw_6_bn/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "conv_dw_6_bn/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "conv_dw_7/depthwise_kernel", "shape": [3, 3, 512, 1], "dtype": "float32"}, {"name": "conv_dw_7_bn/gamma", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_7_bn/beta", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_7_bn/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_7_bn/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_8/depthwise_kernel", "shape": [3, 3, 512, 1], "dtype": "float32"}, {"name": "conv_dw_8_bn/gamma", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_8_bn/beta", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_8_bn/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_8_bn/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_9/depthwise_kernel", "shape": [3, 3, 512, 1], "dtype": "float32"}, {"name": "conv_dw_9_bn/gamma", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_9_bn/beta", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_9_bn/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_9_bn/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "conv_preds/kernel", "shape": [1, 1, 1024, 1000], "dtype": "float32"}, {"name": "conv_preds/bias", "shape": [1000], "dtype": "float32"}, {"name": "conv_pw_1/kernel", "shape": [1, 1, 32, 64], "dtype": "float32"}, {"name": "conv_pw_10/kernel", "shape": [1, 1, 512, 512], "dtype": "float32"}, {"name": "conv_pw_10_bn/gamma", "shape": [512], "dtype": "float32"}, {"name": "conv_pw_10_bn/beta", "shape": [512], "dtype": "float32"}, {"name": "conv_pw_10_bn/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "conv_pw_10_bn/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "conv_pw_11/kernel", "shape": [1, 1, 512, 512], "dtype": "float32"}, {"name": "conv_pw_11_bn/gamma", "shape": [512], "dtype": "float32"}, {"name": "conv_pw_11_bn/beta", "shape": [512], "dtype": "float32"}, {"name": "conv_pw_11_bn/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "conv_pw_11_bn/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "conv_pw_12/kernel", "shape": [1, 1, 512, 1024], "dtype": "float32"}, {"name": "conv_pw_12_bn/gamma", "shape": [1024], "dtype": "float32"}, {"name": "conv_pw_12_bn/beta", "shape": [1024], "dtype": "float32"}, {"name": "conv_pw_12_bn/moving_mean", "shape": [1024], "dtype": "float32"}, {"name": "conv_pw_12_bn/moving_variance", "shape": [1024], "dtype": "float32"}, {"name": "conv_pw_13/kernel", "shape": [1, 1, 1024, 1024], "dtype": "float32"}, {"name": "conv_pw_13_bn/gamma", "shape": [1024], "dtype": "float32"}, {"name": "conv_pw_13_bn/beta", "shape": [1024], "dtype": "float32"}, {"name": "conv_pw_13_bn/moving_mean", "shape": [1024], "dtype": "float32"}, {"name": "conv_pw_13_bn/moving_variance", "shape": [1024], "dtype": "float32"}, {"name": "conv_pw_1_bn/gamma", "shape": [64], "dtype": "float32"}, {"name": "conv_pw_1_bn/beta", "shape": [64], "dtype": "float32"}, {"name": "conv_pw_1_bn/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "conv_pw_1_bn/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "conv_pw_2/kernel", "shape": [1, 1, 64, 128], "dtype": "float32"}, {"name": "conv_pw_2_bn/gamma", "shape": [128], "dtype": "float32"}, {"name": "conv_pw_2_bn/beta", "shape": [128], "dtype": "float32"}, {"name": "conv_pw_2_bn/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "conv_pw_2_bn/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "conv_pw_3/kernel", "shape": [1, 1, 128, 128], "dtype": "float32"}, {"name": "conv_pw_3_bn/gamma", 